public class Main {
    /*
    Напишите метод для нахождения суммы всех элементов в ArrayList<Integer>.
    Напишите метод для поиска наибольшего числа в ArrayList<Integer>.
    Напишите метод для удаления всех четных чисел из ArrayList<Integer>.
    Напишите метод для определения количества положительных чисел в ArrayList<Integer>.
    Напишите метод, который проверяет, содержит ли ArrayList<Integer> заданное число.
    Напишите метод для сортировки ArrayList<Integer> в порядке возрастания.
    Напишите метод для нахождения второго наименьшего числа в ArrayList<Integer>.
    Напишите метод, который объединяет два ArrayList<Integer> в один, удаляя дубликаты элементов.
    Напишите метод для нахождения наибольшей возрастающей подпоследовательности в ArrayList<Integer>.----опционально
    Напишите метод для нахождения наибольшей убывающей подпоследовательности в ArrayList<Integer>..----опционально
    Напишите метод, который возвращает ArrayList<Integer> с уникальными элементами (удаляет дубликаты).
    Напишите метод, который удаляет все повторяющиеся элементы из ArrayList<Integer>.
     */
}
