public class Task2 {

     /*
             * Перебрать элементы первой мапы (Map<Boolean[][], Character[][]>).
            * Для каждого элемента преобразовать Boolean[][] в Character[][], заменив значения true на символ 'T' и false на символ 'F'.
            * Перебрать элементы второй мапы (Map<Integer[][], String[][]>).
            * Для каждого элемента преобразовать Integer[][] в String[][], преобразовав каждое число в строку.
     * Объединить соответствующие элементы из шагов 2 и 4 в новой мапе (Map<Character, String>).
            */
}
